def get_category_value(comment):

    word = {'사고':['사고','사고 처리','보험','위반','손해','안전','불법', '속도', '보험료', '수리비', '무면허', '처리', '과속', '사건', '계약', '미숙'],
            '서비스':['서비스','예약','시간','고객 센터', '반납', '에러', '오류', '대여', '상담', '주차', '주차장', '태도', '대처', '문의', '응대', '소비자', '픽업', '채팅', '홈페이지', '연장', '지연', '장기', '카셰어링', '개선'],
            '앱':['앱', '어플', '장애', '가입', '탈퇴', '인증', '중복 결제', '삭제', '챗봇', '개인정보', '계정', '시스템', '로그인', '비밀번호'],
            '요금':['요금', '인상', '혜택', '쿠폰', '할인', '결제', '비용', '가격', '가성비', '저렴', '돈', '금액'],
            '상태':['상태', '냄새', '청소', '쓰레기', '외관', '실내', '쾌적', '깨끗', '청결', '내부', '외부','스크래치', '담배', '흡연', '위생', '비위생', '파손', '오염', '꽁초', '바닥', '주유', '연료', '관리', '노후'],
            '정비':['고장', '정비', '불량', '수리', '방전', '점검', '교체'],
            '차량':['차량', '트렁크', '네비게이션', '카메라', '유리', '블루투스', '썬팅', '차키', '스마트키', '신차', '센서', '블랙박스', '라이트', '베터리', '브레이크', '승차', '타이어', '차문', '자동차', '하이패스', '번호판', '좌석', '신형'],
            }

    result = []
    for com in comment:
        label = dict()
        for column_name, keywords in word.items():
            if any(key in com for key in keywords):
                label[column_name] = 1
            else:
                label[column_name] = 0
        result.append(label)  # 한 문장에 대한 레이블 7개

    return result